{
  "probability-statistics": {
    "label": "Probability & Statistics",
    "levels": [
      {
        "label": "Combinatorics",
        "description": "Dive into a strategy game of dynamics and arrangement to master the art of counting!"
      },
      {
        "label": "Regression",
        "description": "Step into a world of detective work to predict outcomes and unravel the mysteries behind data points!"
      },
      {
        "label": "Bayesian Statistics",
        "description": "Embark on an adventure where each clue and piece of evidence you gather helps refine your predictions!"
      }
    ]
  },
  "data-structures": {
    "label": "Data Structures",
    "levels": [
      {
        "label": "Linked Lists",
        "description": "DIve into a story where you navigate through clingy nodes, mastering the art of manipulating data sequences!"
      },
      {
        "label": "Binary Trees",
        "description": "Explore the realm of nature and hierarchy, and learn how to structure data to enhance access!"
      },
      {
        "label": "Biparite Graphs",
        "description": "Challenge yourself in an intricate labyrinth and decipher complex relationships within datasets!"
      }
    ]
  },
  "object-oriented-programming": {
    "label": "Object-Oriented Programming",
    "levels": [
      {
        "label": "Classes",
        "description": "Step into the structural architect's shoes, where you design shape entities that evolve in a universe of your making!"
      },
      {
        "label": "Polymorphism",
        "description": "Master the arcane skill of puppetry by creating flexible and reusuable entities!"
      },
      {
        "label": "Design Patterns",
        "description": "Try your hand at elegant caligraphy via a codex of tried-and-tested strategies!"
      }
    ]
  },
  "algorithms": {
    "label": "Algorithms",
    "levels": [
      {
        "label": "Dijkstra's",
        "description": "Set out on an interstellar quest, while conquering the shortest paths toward home!"
      },
      {
        "label": "Kruskal's",
        "description": "Traverse the art of connection, where you'll build bridges and unite scattered islands into a single landmass!"
      },
      {
        "label": "NP-Completeness",
        "description": "Enter the domain of unsolved mind games and challenge yourself at the limits of computation!"
      }
    ]
  },
  "dynamic-programming": {
    "label": "Dynamic Programming",
    "levels": [
      {
        "label": "Fibonacci Sequence",
        "description": "Unravel the spirals of growth, where each step builds upon the last to master the power of addition!"
      },
      {
        "label": "Memoization",
        "description": "Reminisce forgotten magic to cast future spells more swifty!"
      },
      {
        "label": "State Machine Optimization",
        "description": "Step into your role as emperor of a warring nation, and lead your people to a quick victory!"
      }
    ]
  },
  "machine-learning": {
    "label": "Machine Learning",
    "levels": [
      {
        "label": "Decision Tree",
        "description": "Embark on a quest of fortune telling, where each choice branhes your path toward prediction!"
      },
      {
        "label": "Dimensionality Reduction",
        "description": "Navigate vast, multidimensional landscapes with a magical compass that simplifies complexity!"
      },
      {
        "label": "Neural Networks",
        "description": "Harness the power of an enchanted peer network, where interconnected insights reveal the world's hidden patterns!"
      }
    ]
  }
}
